InformationRegisters/ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоОкончании</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисленияУдержания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыРабочегоВремениСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыРабочегоВремениСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу полную рабочую смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеСверхНормы</Name>
					<Comment>Начисление за работу сверх нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦелодневноеНеотработанное</Name>
					<Comment>Неотработанные полные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеНеотработанное</Name>
					<Comment>Неотработанные неполные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноОплачиваемоеВПределахНормы</Name>
					<Comment>Дополнительное начисление в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу неполную смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьСотрудниковДляОбновленияТекущихТарифныхСтавок();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	КадровыйУчет.ОбновитьВторичныеКадровыеДанныеСотрудников(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьСотрудниковДляОбновленияТекущихТарифныхСтавок()
	
	// Обновлять записи необходимо, только при записи набора, содержащего первичные данные.
	Если ДополнительныеСвойства.Свойство("ЭтоВторичныйНабор") 
		И ДополнительныеСвойства.ЭтоВторичныйНабор Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ИзмеренияДаты = Новый ТаблицаЗначений;
	ИзмеренияДаты.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ИзмеренияДаты.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	СтрокаИзмеренияДаты = ИзмеренияДаты.Добавить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "=", Отбор.Регистратор.Значение.Ссылка);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИзмеренияДаты),
		ПараметрыПостроения);
	
	Запрос.УстановитьПараметр("Источник", Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаборИсточник.Сотрудник,
	|	НаборИсточник.Показатель
	|ПОМЕСТИТЬ ВТСохраняемыеЗначения
	|ИЗ
	|	&Источник КАК НаборИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СохраняемыеЗначения.Сотрудник ЕСТЬ NULL 
	|			ТОГДА ПредыдущиеЗначения.Сотрудник
	|		ИНАЧЕ СохраняемыеЗначения.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА СохраняемыеЗначения.Показатель ЕСТЬ NULL 
	|			ТОГДА ПредыдущиеЗначения.Показатель
	|		ИНАЧЕ СохраняемыеЗначения.Показатель
	|	КОНЕЦ КАК Показатель
	|ПОМЕСТИТЬ ВТВсеДанныеРегистратора
	|ИЗ
	|	ВТСохраняемыеЗначения КАК СохраняемыеЗначения
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников КАК ПредыдущиеЗначения
	|		ПО СохраняемыеЗначения.Сотрудник = ПредыдущиеЗначения.Сотрудник
	|			И СохраняемыеЗначения.Показатель = ПредыдущиеЗначения.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВсеДанныеРегистратора.Сотрудник
	|ИЗ
	|	ВТВсеДанныеРегистратора КАК ВсеДанныеРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
	|		ПО ВсеДанныеРегистратора.Показатель = НачисленияПоказатели.Показатель
	|			И (НачисленияПоказатели.ОсновнойПоказатель)
	|			И (НачисленияПоказатели.Ссылка.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы)))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если в выборке нет сотрудников, прерываем дальнейшую обработку.
	Если НЕ РезультатЗапроса.Пустой() Тогда
		КадровыйУчет.ЗапомнитьСписокСотрудниковДляОбновленияДанныхОбОплатеТруда(ЭтотОбъект, РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
